Repository: LogicBoots/StethApp
Catalog: lib/l10n/app_*.arb
Languages: de, fr, hi

# appTitle
source: StethApp
hi: स्टेथएप

source: Login
de: Anmelden
fr: Connexion
hi: लॉगिन

source: Email
hi: ईमेल

source: Password
de: Passwort
fr: Mot de passe
hi: पासवर्ड

source: Connect Stethoscope
de: Stethoskop Verbinden
fr: Connecter le Stéthoscope
hi: स्टेथोस्कोप कनेक्ट करें

source: Start AI Analysis
de: KI-Analyse Starten
fr: Démarrer l'Analyse IA
hi: एआई विश्लेषण शुरू करें

source: Connection Method
de: Verbindungsmethode
fr: Méthode de Connexion
hi: कनेक्शन विधि

source: Wi-Fi
de: WLAN
hi: वाई-फाई

source: Bluetooth
hi: ब्लूटूथ

source: Cancel
de: Abbrechen
fr: Annuler
hi: रद्द करें

source: Connecting via Wi-Fi...
de: Verbindung über WLAN...
fr: Connexion via Wi-Fi...
hi: वाई-फाई के माध्यम से कनेक्ट हो रहे हैं...

# connectedViaWifiSuccess
source: Connected via Wi-Fi successfully!
de: Erfolgreich über WLAN verbunden!
fr: Connecté via Wi-Fi avec succès !
hi: वाई-फाई के माध्यम से सफलतापूर्वक कनेक्ट हो गए!

source: Pairing via Bluetooth...
de: Kopplung über Bluetooth...
fr: Appariement via Bluetooth...
hi: ब्लूटूथ के माध्यम से पेयरिंग हो रहे हैं...

# connectedViaBluetoothSuccess
source: Connected via Bluetooth successfully!
de: Erfolgreich über Bluetooth verbunden!
fr: Connecté via Bluetooth avec succès !
hi: ब्लूटूथ के माध्यम से सफलतापूर्वक कनेक्ट हो गए!

# usingDummyDataset
source: Using dummy dataset for demo
de: Verwende Dummy-Datensatz für Demo
fr: Utilisation d'un jeu de données fictif pour la démo
hi: डेमो के लिए डमी डेटासेट का उपयोग कर रहे हैं

# modelNotLoaded
source: Model not loaded yet
de: Modell noch nicht geladen
fr: Modèle pas encore chargé
hi: मॉडल अभी तक लोड नहीं हुआ

# modelLoadedSuccess
source: Model loaded successfully
de: Modell erfolgreich geladen
fr: Modèle chargé avec succès
hi: मॉडल सफलतापूर्वक लोड हुआ

source: Failed to load model
de: Fehler beim Laden des Modells
fr: Échec du chargement du modèle
hi: मॉडल लोड करने में विफल

# analysisFailed
source: Analysis failed: {error}
de: Analyse fehlgeschlagen: {error}
fr: Échec de l'analyse : {error}
hi: विश्लेषण विफल: {error}

# failedToLoadAudioFiles
source: Failed to load audio files: {error}
de: Fehler beim Laden der Audio-Dateien: {error}
fr: Échec du chargement des fichiers audio : {error}
hi: ऑडियो फाइलें लोड करने में विफल: {error}

source: Loading Audio Files...
de: Lade Audio-Dateien...
fr: Chargement des Fichiers Audio...
hi: ऑडियो फाइलें लोड हो रही हैं...

source: Audio Dataset Results
de: Audio-Datensatz Ergebnisse
fr: Résultats du Jeu de Données Audio
hi: ऑडियो डेटासेट परिणाम

source: Stethoscope disconnected
de: Stethoskop getrennt
fr: Stéthoscope déconnecté
hi: स्टेथोस्कोप डिस्कनेक्ट हो गया

source: Close
de: Schließen
fr: Fermer
hi: बंद करें

source: Language
de: Sprache
fr: Langue
hi: भाषा

source: Settings
de: Einstellungen
fr: Paramètres
hi: सेटिंग्स

# appSubtitle
source: Listen and analyze heart & lung sounds with AI
de: Hör- und Lungengeräusche mit KI anhören und analysieren
fr: Écoutez et analysez les sons cardiaques et pulmonaires avec l'IA
hi: AI के साथ हृदय और फेफड़ों की आवाज़ें सुनें और उनका विश्लेषण करें

source: Welcome Back!
de: Willkommen zurück!
fr: Bon retour !
hi: वापस स्वागत है!

source: Sign in to continue
de: Anmelden, um fortzufahren
fr: Connectez-vous pour continuer
hi: जारी रखने के लिए साइन इन करें

# enterEmail
source: Enter your email
de: E-Mail eingeben
fr: Entrez votre e-mail
hi: अपना ईमेल दर्ज करें

# pleaseEnterEmail
source: Please enter your email
de: Bitte geben Sie Ihre E-Mail ein
fr: Veuillez entrer votre e-mail
hi: कृपया अपना ईमेल दर्ज करें

# pleaseEnterValidEmail
source: Please enter a valid email
de: Bitte geben Sie eine gültige E-Mail ein
fr: Veuillez entrer un e-mail valide
hi: कृपया एक वैध ईमेल दर्ज करें

# enterPassword
source: Enter your password
de: Passwort eingeben
fr: Entrez votre mot de passe
hi: अपना पासवर्ड दर्ज करें

# pleaseEnterPassword
source: Please enter your password
de: Bitte geben Sie Ihr Passwort ein
fr: Veuillez entrer votre mot de passe
hi: कृपया अपना पासवर्ड दर्ज करें

# passwordMinLength
source: Password must be at least 6 characters
de: Das Passwort muss mindestens 6 Zeichen lang sein
fr: Le mot de passe doit comporter au moins 6 caractères
hi: पासवर्ड कम से कम 6 अक्षर का होना चाहिए

source: Remember Me
de: Angemeldet bleiben
fr: Se souvenir de moi
hi: मुझे याद रखें

source: Forgot Password?
de: Passwort vergessen?
fr: Mot de passe oublié ?
hi: पासवर्ड भूल गए?

# forgotPasswordComingSoon
source: Forgot password feature coming soon
de: Passwort vergessen Funktion kommt bald
fr: La fonctionnalité mot de passe oublié arrive bientôt
hi: पासवर्ड भूलने की सुविधा जल्द आ रही है

source: OR
de: ODER
fr: OU
hi: या

source: Continue as Guest
de: Als Gast fortfahren
fr: Continuer en tant qu'invité
hi: गेस्ट के रूप में जारी रखें

# dontHaveAccount
source: Don't have an account?
de: Sie haben noch kein Konto?
fr: Vous n'avez pas de compte ?
hi: कोई खाता नहीं है?

source: Sign Up
de: Registrieren
fr: S'inscrire
hi: साइन अप करें

# signUpComingSoon
source: Sign up feature coming soon
de: Registrierungsfunktion kommt bald
fr: La fonctionnalité d'inscription arrive bientôt
hi: साइन अप की सुविधा जल्द आ रही है

source: Connect via wireless network
de: Über drahtloses Netzwerk verbinden
fr: Connecter via le réseau sans fil
hi: वायरलेस नेटवर्क के माध्यम से कनेक्ट करें

source: Connect via Bluetooth pairing
de: Über Bluetooth-Kopplung verbinden
fr: Connecter via l'appariement Bluetooth
hi: ब्लूटूथ पेयरिंग के माध्यम से कनेक्ट करें

source: ECG Waveform
de: EKG-Wellenform
fr: Forme d'onde ECG
hi: ईसीजी तरंगरूप

source: LIVE
de: Echtzeit
fr: EN DIRECT
hi: लाइव

source: Stethoscope connected
de: Stethoskop verbunden
fr: Stéthoscope connecté
hi: स्टेथोस्कोप कनेक्ट हो गया

source: Disconnect
de: Trennen
fr: Déconnecter
hi: अलग करें

source: Analyzing...
de: Wird analysiert...
fr: Analyse en cours...
hi: विश्लेषण हो रहा है...

source: Connect Digital Stethoscope
de: Digitales Stethoskop verbinden
fr: Connecter le Stéthoscope Numérique
hi: डिजिटल स्टेथोस्कोप कनेक्ट करें

source: Choose connection method:
de: Verbindungsmethode wählen:
fr: Choisissez la méthode de connexion :
hi: कनेक्शन विधि चुनें:

source: Select Disease Category
de: Krankheitskategorie Auswählen
fr: Sélectionner la Catégorie de Maladie
hi: रोग श्रेणी चुनें

# pneumoniaTB
source: Pneumonia & TB Detection
de: Pneumonie & TB Erkennung
fr: Détection Pneumonie et TB
hi: निमोनिया और TB का पता लगाना

# copdAsthma
source: COPD & Asthma Detection
de: COPD & Asthma Erkennung
fr: Détection BPCO et Asthme
hi: COPD और अस्थमा का पता लगाना

# chooseAnalysisType
source: Choose the type of analysis you want to perform:
de: Wählen Sie die Art der Analyse, die Sie durchführen möchten:
fr: Choisissez le type d'analyse que vous souhaitez effectuer :
hi: आप किस प्रकार का विश्लेषण करना चाहते हैं उसे चुनें:
